Revit.Elements.RoofType.GetThermalProperties
The calculated and settable thermal properties of the RoofType.
Value of absorptance.
The heat transfer coefficient value (U-Value).
Value of roughness.
The calculated thermal mass value.
The calculated thermal resistance value (R-Value).